# RailCurveTooShort Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..RailCurveTooShort Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Curve in rail sketch is too short for rail creation and ignored.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RailCurveTooShort { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RailCurveTooShort As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RailCurveTooShort {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace